---
kind: method
id: M:Autodesk.Revit.DB.Structure.AreaReinforcementType.CreateDefaultAreaReinforcementType(Autodesk.Revit.DB.Document)
source: html/451102b4-f55e-df96-a1b3-4f6e968f47ca.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcementType.CreateDefaultAreaReinforcementType Method

Creates a new AreaReinforcementType object with a default name.

## Syntax (C#)
```csharp
public static ElementId CreateDefaultAreaReinforcementType(
	Document aDoc
)
```

## Parameters
- **aDoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The newly created type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null